# Список - это упорядочный конечный набор элементов.
# Создание пустого списка

# list_1 = []
# list_2 = list()

# Вывод списка
# list_1 = [7, 9, 11, 13, 15, 17]
# for i in list_1:
#     print(i, end=' ')
# print()
# print(*list_1) # Звездочка используется для того, чтобы без квадратных скобочек 

# Нумерация списков
# list_1 = [7, 9, 11, 13, 15, 17]
# print(list_1[0])
# print(list_1[-1])
# print(len(list_1)) # Показывает длину списка

# Добавление элементов
# list_1 = [1, 5]
# list_1.append(8)
# print(list_1)
# list_1.append(85)
# print(list_1)

# Добавление элементов с помощью цикла for
# list_1 = []
# for i in range(5):
#     list_1.append(i)
#     print(list_1)

# Добавление элемента на нужную позицию
# list_1 = [12, 7, -1, 21, 0]
# list_1.insert(2, 11)
# print(list_1)

# Удаление последнего элемента из списка
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop())
# a = list_1.pop() # Метод pop удаляет и возвращает удаленное значение
# print(a)

# Удаление кокретного элемента
# list_1 = [12, 7, -1, 21, 0]
# print(list_1.pop(0))

# Срезы
# list_1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(list_1[0])
# print(list_1[len(list_1) - 1])
# print(list_1[-5])
# print(list_1[:])  # Весь список
# print(list_1[:2]) # От начала (с 0 индекса до 2(не включая 2))
# print(list_1[len(list_1) - 2:]) # До конца
# print(list_1[2:9])
# print(list_1[6:-18])
# print(list_1[0:len(list_1):6]) # 6 - шаг списка
# print(list_1[::6]) # 6 - шаг списка

# Кортеж - неизменяемый список
# 