# Задача №1. 
# За день машина проезжает n километров. Сколько
# дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя
# пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750
# Output:
# 2

# print('Введите сколько километров проезжает машина в день: ')
# n = int(input())
# print('Введите длину маршрута: ')
# m = int(input())
# print(f"Необходимо {(n + m - 1) // n} дней(я)")
# print(abs(-m // n))
# print((m // n) + 1 - (m == n))






















# Задача №3. 
# В некоторой школе решили набрать три новых
# математических класса и оборудовать кабинеты для
# них новыми партами. За каждой партой может сидеть
# два учащихся. Известно количество учащихся в
# каждом из трех классов. Выведите наименьшее
# число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)
# Output: 32


# a = int(input('Введите кодичество учащихся в первом классе: '))

# b = int(input('Введите кодичество учащихся во втором классе: '))

# c = int(input('Введите кодичество учащихся в третьем классе: '))
# print(f"Необходимо: {(a // 2 + a % 2 + b // 2 + b % 2 + c // 2 + c % 2)} парт")
# print(a // 2 + (a % 2 != 0) + abs( -b // 2) + (c + 1) // 2)
















# Задача №5. 
# Вагоны в электричке пронумерованы натуральными
# числами, начиная с 1 (при этом иногда вагоны
# нумеруются от «головы» поезда, а иногда – с
# «хвоста»; это зависит от того, в какую сторону едет
# электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил,
# что его вагон имеет номер j. Он хочет определить,
# сколько всего вагонов в электричке. Напишите
# программу, которая будет это делать или сообщать,
# что без дополнительной информации это сделать
# невозможно.
# Input: 3 4(ввод на разных строках)
# Output: 6

# print('Введите номер вагона с головы электрички: ')
# i = int(input())
# print('Введите  реальный номер вагона электрички: ')
# j = int(input())
# if (i == j):
#     print('Без дополнительной информации решить не возможно')
# else:
#     print(f"Количество вагонов: {i + j - 1}")














# Задача №7. 
# Дано натуральное число. Требуется определить,
# является ли год с данным номером високосным. Если
# год является високосным, то выведите YES, иначе
# выведите NO. Напомним, что в соответствии с
# григорианским календарем, год является
# високосным, если его номер кратен 4, но не кратен
# 100, а также если он кратен 400.
# Input: 2016
# Output: YES
    
# print('Введите год: ')
# year = int(input())
# if year % 400 == 0 or year % 4 == 0 and year % 100 != 0:
#     print("YES")
# else:
#     print('NO')

# # вводится три длины сторон треугольника. определить можно ли из них построить треугольник
# a = 5
# b = 7
# c = 12
# if a + b == c:
#     print('yes')
# else:
#     print('no')