# Знакомство с аналитикой

# Знакомство с аналитикой. Мы будем пользоваться таким
# инструментом как Google Сolab.

# На лекции мы познакомимся с инструментом для работы с
# табличными данными(pandas) и способами визуализации данных с
# помощью библиотек matplotlib и seaborn. Прежде, чем приступать
# непосредственно к машинному обучению, важно произвести
# EDA(Exploratory Data Analysis) - Разведочный анализ данных.

# Он состоит в анализе основных свойств данных, нахождения в них
# общих закономерностей, распределений и аномалий, построение
# начальных моделей, зачастую с использованием инструментов
# визуализации.

# Понятие введено математиком Джоном Тьюки, который
# сформулировал цели такого анализа следующим образом:

# 1. Максимальное «проникновение» в данные
# 2. Выявление основных структур
# 3. Выбор наиболее важных переменных
# 4. Обнаружение отклонений и аномалий
# 5. Проверка основных гипотез