# Задача 16: 
# Требуется вычислить, сколько раз встречается некоторое
# число X в массиве A[1..N]. Пользователь в первой строке вводит
# натуральное число N – количество элементов в массиве. В последующих
# строках записаны N целых чисел Ai. Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 3 -> 1

# n = int(input('Введите количество элементов в массиве: '))
# list_1 = [int(i) for i in input('Введите элементы списка через пробел: ').split()]
     
# k = int(input('Ведите число из массива: '))

# count = 0
# for i in list_1:
#     if k == i:
#         count += 1
# print(count)

# print(list_1.count(k))




# Задача 18: 
# Требуется найти в массиве A[1..N] самый близкий по
# величине элемент к заданному числу X. Пользователь в первой строке
# вводит натуральное число N – количество элементов в массиве. В
# последующих строках записаны N целых чисел Ai. Последняя строка
# содержит число X
# 5
# 1 2 3 4 5
# 6 -> 5

n = int(input('Введите количество элементов в массиве: '))
list_1 = [int(i) for i in input('Введите элементы списка через пробел: ').split()]
k = int(input('Ведите число: '))
num = abs(k - list_1[0])
x = 0
# for i in range(1, len(list_1)):
#     count = abs(k - list_1[i])
#     if count < min:
#         min = count
#         index = i
# print(list_1[index])

for i in list_1:
    if (abs(k - i) < num):
        num = abs(k - i)
        x = i
print(x)

# Задача 20: 
# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную
# ценность. В случае с английским алфавитом очки распределяются так:
# ● A, E, I, O, U, L, N, S, T, R – 1 очко;
# ● D, G – 2 очка;
# ● B, C, M, P – 3 очка;
# ● F, H, V, W, Y – 4 очка;
# ● K – 5 очков;
# ● J, X – 8 очков;
# ● Q, Z – 10 очков.
# А русские буквы оцениваются так:
# ● А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# ● Д, К, Л, М, П, У – 2 очка;
# ● Б, Г, Ё, Ь, Я – 3 очка;
# ● Й, Ы – 4 очка;
# ● Ж, З, Х, Ц, Ч – 5 очков;
# ● Ш, Э, Ю – 8 очков;
# ● Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только
# английские, либо только русские буквы.
# Ввод:
# ноутбук
# Вывод:
# 12


# dict = {"AEIOULNSTRАВЕИНОРСТ": 1,
#       	"DGДКЛМПУ": 2,
#       	"BCMPБГЁЬЯ": 3,
#       	"FHVWYЙЫ": 4,
#       	"KЖЗХЦЧ": 5,
#       	"JZШЭЮ": 8,
#       	"QZФЩЪ": 10}

# k = input('Введите слово: ').upper()

# summa = 0
# for i in k:
#     for k, v in dict.items():
#         if i in k:
#             summa += v

# print(f'Стоимость слова: {summa}')