# Задача №17. 
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

# Примечание: Пользователь может вводить значения
# списка или список задан изначально.

# lst = [1, 1, 2, 0, -1, 3, 4, 4]
# # print(len(set(lst)))
# lst_1 = []
# # for i in lst:
# #     if i not in lst_1:
# #         lst_1.append(i)
# lst_1 = [i for i in lst if i not in lst_1] # Неправильно
# print(len(lst_1))

# Задача №19. 
# Дана последовательность из N целых чисел и число
# K. Необходимо сдвинуть всю последовательность
# (сдвиг - циклический) на K элементов вправо, K –
# положительное число.
# Input: [1, 2, 3, 4, 5] k = 3
# Output: [4, 5, 1, 2, 3]

# Примечание: Пользователь может вводить значения
# списка или список задан изначально.
# lst = [1, 2, 3, 4, 5]
# k = 3
# lst_output = lst[-k:] + lst[:-k]
# print(lst_output)
# lst = [1, 2, 3, 4, 5]
# k = 5
# # new_lst = [0] * len(lst)
# for i in range(k):
#     temp = lst.pop()
#     lst.insert(0, temp)
#     print(lst)



# Задача №21. 
# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Примечание: Список словарей задан изначально.
# Пользователь его не вводит

# data = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]
# unique_values = set() # создаем множество
# for item in data:
#     for value in item.values(): # Проходим по значениям в каждом словаре
#         unique_values.add(value)
# print("Исходный словарь: ", data) # Вывод исходных данных
# print(unique_values) #Преобразуем список уникальных значений во множество и выводим его


# dic = [
#     {"V": "S001"},
#     {"V": "S002"},
#     {"VI": "S001"},
#     {"VI": "S005"},
#     {"VII": " S005 "},
#     {" V ": " S009 "},
#     {" VIII ": " S007 "},
# ]

# # s = set()
# # for i in dic:
# #     for k, v in i.items():
# #         s.add(v)

# # print(s)

# s = set()
# for i in dic:
#     for v in i.values():
#         s.add(v)
#         i[v]
# print(s)

# Задача №23. 
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая подсчитает количество
# элементов массива, больших предыдущего (элемента
# с предыдущим номером)
# Input: [0, -1, 5, 2, 3]
# Output: 2 (-1 < 5, 2 < 3)

# Примечание: Пользователь может вводить значения
# списка или список задан изначально.

# lst_1 = [0, -1, 5, 2, 3]
# counter = 0
# for i in range(1, len(lst_1)):
#     if lst_1[i] > lst_1[i - 1]:
#         counter += 1
# print(counter)

# N = abs(int(input('Введите количество элементов списка А: ')))
# A_entered = input("Введите через пробел элементы списка: ").split()
# A_num = list(map(int, A_entered))
# if len(A_num) != N or N == 0:
#     print('Введенные элементы не соответствуют заявленному количеству!')
# else:
#     X = int(input('Введите число X, с которым необходимо сравнивать элементы списка: '))
#     min = abs(X - A_num[0])
#     index = 0
#     for i in range(1, N):
#         count = abs(X - A_num[i])
#         if count < min:
#             min = count
#             index = i
#     print(f'Число {A_num[index]} в списке A наиболее близко по величине к числу {X}, их разница составляет {abs(X - A_num[index])}')


# points_en = {1: 'AEIOULNSTR', 2: 'DG', 3: 'BCMP', 4: 'FHVWY', 5: 'K', 8: 'JX', 10: 'QZ'}
# points_ru = {1: 'АВЕИНОРСТ', 2: 'ДКЛМПУ', 3: 'БГЁЬЯ', 4: 'ЙЫ', 5: 'ЖЗХЦЧ', 8: 'ШЭЮ', 10: 'ФЩЪ'}
# k = input("Введите слово: ")
# word = k.upper()  # переводим все буквы в верхний регистр
# count = 0
# for i in word:
#     if i in 'QWERTYUIOPASDFGHJKLZXCVBNM':
#         for j in points_en:
#             if i in points_en[j]:
#                 count = count + j
#     else:
#         for j in points_en:
#             if i in points_ru[j]:
#                 count = count + j
# print('Количество очков: ', count)

# Вводятся номера телефонов в одну строчку через пробел с разными кодами 
# стран: +7, +6, +2, +4 и т.д. Необходимо составить словарь d, где ключи - 
# это коды +7, +6, +2 и т.п., а значения - список номеров 
# (следующих в том же порядке, что и во входной строке) с соответствующими кодами. 
# Полученный словарь вывести командой:

# print(*sorted(d.items()))

# Sample Input:
# +71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890
# Sample Output:
# ('+2', ['+21235777890', '+21234567110']) ('+5', ['+52134567890']) ('+6', ['+61234576890']) 
# ('+7', ['+71234567890', '+71234567854', '+71232267890'])

number_rou = '+71234567890 +71234567854 +61234576890 +52134567890 \
      +21235777890 +21234567110 +71232267890'
number_list = list(number_rou.split())
number_dict = dict()

for i in number_list:
    if i[:2] in number_dict:
        number_dict[i[:2]].append(i)
    else:
        number_dict[i[:2]] = [i]

print(*sorted(number_dict.items()))